# RampAttrThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RampAttrThickness Property
ParameterTypeId Class See Also
---
"Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RampAttrThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampAttrThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RampAttrThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace